
import Foundation
struct QuestionsList {
    let questionList = [
        Question(ask: "Какой город является столицей Таиланда?", correctAnswer: "Бангкок", answers: ["Паттайя", "Пхукет", "Манила","Бангкок"]),
        Question(ask: "Как называется самое большое озеро в мире, которое граничит с Персией и называется морем?", correctAnswer: "Каспийское", answers: ["Урмия","Каспийское", "Женева", "Ренн"]),
        Question(ask: "Визитной карточкой какого знаменитого актера роль Марти в фильме «Назад в будущее»?", correctAnswer: "Майкл Джей. Фокс", answers: ["Мэл Гибсон", "Киану Ривз","Майкл Джей. Фокс", "Том Хэнкс"]),
        Question(ask: "Сколько будет 17 умножить на 18?", correctAnswer: "306", answers: ["399", "279","306", "216"]),
        Question(ask: "Кто из перечисленных актеров сыграл роль Форреста Гампа в одноименном фильме?", correctAnswer: "Том Хэнкс", answers: ["Мэл Гибсон ","Том Хэнкс", "Брюс Уиллис", "Ричард Гир"]),
        Question(ask: "Кто из теннисистов удерживал лидерские позиции на протяжении 377 недель?", correctAnswer: "Штеффи Граф", answers: ["Винус Уильямс","Штеффи Граф", "Мартина Хиггинс ", "Роджер Федерер"]),
        Question(ask: "Какая планета Солнечной системы самая большая?", correctAnswer: "Юпитер", answers: ["Уран","Юпитер", "Нептун", "Сатурн"]),
        Question(ask: "Куда делается внутрикожный укол?", correctAnswer: "Внутрь кожи", answers: ["Внутрь мускула","Внутрь кожи", "Внутрь вены", "Под кожу"]),
        Question(ask: "Какой напиток является специфическим для стран Карибского бассейна?", correctAnswer: "Ром", answers: ["Водка", "Пиво", "Текила","Ром"]),
        Question(ask: "Какой стране принадлежит авиакомпания Kingfisher  Airlines?", correctAnswer: "Индия", answers: ["США","Индия", "Франция", "Англия"]),
        Question(ask: "Кто написал музыку для фильма «Гарри Поттер»?", correctAnswer: "Джон Уильямс ", answers: ["Моцарт","Джон Уильямс ", "Билли Джоэл", "Себастьян Бах"]),
        Question(ask: "Как называется команда Орландо в Национальной Баскетбольной Ассоциации (NBA)?", correctAnswer: "Magic", answers: ["Bulls","Magic", "Cavaliers", "Celtics"]),
        Question(ask: "Какая страна не граничит с Констанцским озером?", correctAnswer: "Франция", answers: ["Германия","Франция", "Швейцария", "Австрия"]),
        Question(ask: "Для исполнения традиционного андалусского танца скорби, в котором множество сложных фигур, используется гитара. Как называется эта музыка и танец?", correctAnswer: "Фламенко", answers: ["Болеро","Фламенко", "Танго", "Румба"]),
        Question(ask: "Кто автор повестей «Повесть о двух городах» и «Большие надежды», написанных в 19 веке?", correctAnswer: "Ч. Диккенс", answers: ["Т. Янсонн","Ч. Диккенс", "Б. Брехт", "Ф. Кафка"])
    ]

}
